In [2]:
import pandas as pd 
import numpy as np 

pd_series = pd.Series ([5, 6, 7, 8, 9, 10])
pd_series

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [3]:
pd_series.index

RangeIndex(start=0, stop=6, step=1)

In [4]:
r_index = pd.RangeIndex (0, 6, 1)

In [5]:
iter(r_index)

In [6]:
pd_series.values

array([ 5,  6,  7,  8,  9, 10])

In [7]:
pd_array = pd.array([1,2,3])

In [9]:
pd_array[1]

2

In [10]:
stars_sys = pd.Series(
    [4.2421, 5.9630, 6.588, 7.18, 7.7825, 8.2905],
    index = ['Alfa', 'Bernard', 'Lumann', 'WISE', 'Woolf', 'Laland']
)
stars_sys

Alfa       4.2421
Bernard    5.9630
Lumann     6.5880
WISE       7.1800
Woolf      7.7825
Laland     8.2905
dtype: float64

In [11]:
stars_sys.index

Index(['Alfa', 'Bernard', 'Lumann', 'WISE', 'Woolf', 'Laland'], dtype='object')

In [12]:
pd_series

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [13]:
pd_series[4]

9

In [14]:
pd_series[[4,3]]

4    9
3    8
dtype: int64

In [17]:
stars_sys[['Alfa', 'Bernard']]

Alfa       4.2421
Bernard    5.9630
dtype: float64

In [18]:
stars_sys['Bernard']=-1

In [19]:
stars_sys['Bernard']

-1.0

In [21]:
stars_sys[[ 'Lumann', 'WISE', 'Laland']] = 0
stars_sys

Alfa       4.2421
Bernard   -1.0000
Lumann     0.0000
WISE       0.0000
Woolf      7.7825
Laland     0.0000
dtype: float64

In [23]:
stars_sys[(stars_sys>0)]

Alfa     4.2421
Woolf    7.7825
dtype: float64

In [24]:
stars_sys = pd.Series(
    [4.2421, 5.9630, 6.588, 7.18, 7.7825, 8.2905],
    index = ['Alfa', 'Bernard', 'Lumann', 'WISE', 'Woolf', 'Laland']
)
stars_sys

Alfa       4.2421
Bernard    5.9630
Lumann     6.5880
WISE       7.1800
Woolf      7.7825
Laland     8.2905
dtype: float64

In [25]:
stars_sys.name = 'Distance'
stars_sys.index.name = 'Star'
stars_sys

Star
Alfa       4.2421
Bernard    5.9630
Lumann     6.5880
WISE       7.1800
Woolf      7.7825
Laland     8.2905
Name: Distance, dtype: float64

In [28]:
df = pd.DataFrame({
    'country': ['Kaz', 'Rus', 'Belarus', 'Ukr'],
    'population': [17.04, 143.5, 9.5, 45.5],
    'square':[27, 171, 2, 6]
})
df

   country  population  square
0      Kaz       17.04      27
1      Rus      143.50     171
2  Belarus        9.50       2
3      Ukr       45.50       6

In [29]:
df.population

0     17.04
1    143.50
2      9.50
3     45.50
Name: population, dtype: float64

In [30]:
type(df.population)

pandas.core.series.Series

In [31]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [32]:
df.index = ['KZ', 'RUS', 'BY', 'UA']
df

     country  population  square
KZ       Kaz       17.04      27
RUS      Rus      143.50     171
BY   Belarus        9.50       2
UA       Ukr       45.50       6

In [33]:
df.index.name = 'country_code'

In [34]:
df

              country  population  square
country_code
KZ                Kaz       17.04      27
RUS               Rus      143.50     171
BY            Belarus        9.50       2
UA                Ukr       45.50       6

In [35]:
df.loc['KZ']

country         Kaz
population    17.04
square           27
Name: KZ, dtype: object

In [36]:
df.iloc[0]

country         Kaz
population    17.04
square           27
Name: KZ, dtype: object

In [37]:
df.loc['KZ','population']

17.04

In [39]:
type (df.loc['KZ'])

pandas.core.series.Series

In [40]:
df.loc[['KZ','RUS'],['population','square']]

              population  square
country_code
KZ                 17.04      27
RUS               143.50     171

In [43]:
df.iloc[[0,1],[1]]

              population
country_code
KZ                 17.04
RUS               143.50

In [44]:
df.iloc[[0,1],[0]]

             country
country_code
KZ               Kaz
RUS              Rus

In [45]:
df['country']

country_code
KZ         Kaz
RUS        Rus
BY     Belarus
UA         Ukr
Name: country, dtype: object

In [46]:
df[['country']]

              country
country_code
KZ                Kaz
RUS               Rus
BY            Belarus
UA                Ukr

In [47]:
type(df[['country']])

pandas.core.frame.DataFrame

In [48]:
type(df['country'])

pandas.core.series.Series

In [50]:
df.population>10

country_code
KZ      True
RUS     True
BY     False
UA      True
Name: population, dtype: bool

In [51]:
df[df.population>10]

             country  population  square
country_code
KZ               Kaz       17.04      27
RUS              Rus      143.50     171
UA               Ukr       45.50       6

In [52]:
df[df.population>10][['country','square']]

             country  square
country_code
KZ               Kaz      27
RUS              Rus     171
UA               Ukr       6

In [55]:
df[(df.population>10) & (df.country == 'Rus')][['country','square']]

             country  square
country_code
RUS              Rus     171

In [56]:
filters = (df.country == 'Rus')
df[filters]

             country  population  square
country_code
RUS              Rus       143.5     171

In [57]:
df['density']=df['population']/df['square']
df

              country  population  square   density
country_code
KZ                Kaz       17.04      27  0.631111
RUS               Rus      143.50     171  0.839181
BY            Belarus        9.50       2  4.750000
UA                Ukr       45.50       6  7.583333

In [58]:
df['lol']=1
df

              country  population  square   density  lol
country_code
KZ                Kaz       17.04      27  0.631111    1
RUS               Rus      143.50     171  0.839181    1
BY            Belarus        9.50       2  4.750000    1
UA                Ukr       45.50       6  7.583333    1

In [60]:
df.drop(['lol'], axis=1)

              country  population  square   density
country_code
KZ                Kaz       17.04      27  0.631111
RUS               Rus      143.50     171  0.839181
BY            Belarus        9.50       2  4.750000
UA                Ukr       45.50       6  7.583333

In [62]:
df = df.drop(['lol'], axis=1)

In [63]:
df

              country  population  square   density
country_code
KZ                Kaz       17.04      27  0.631111
RUS               Rus      143.50     171  0.839181
BY            Belarus        9.50       2  4.750000
UA                Ukr       45.50       6  7.583333

In [64]:
df.columns

Index(['country', 'population', 'square', 'density'], dtype='object')

In [65]:
df = df.rename(columns={'country':'country_name'})
df

             country_name  population  square   density
country_code
KZ                    Kaz       17.04      27  0.631111
RUS                   Rus      143.50     171  0.839181
BY                Belarus        9.50       2  4.750000
UA                    Ukr       45.50       6  7.583333

In [66]:
df.nlargest(3, 'population')

             country_name  population  square   density
country_code
RUS                   Rus      143.50     171  0.839181
UA                    Ukr       45.50       6  7.583333
KZ                    Kaz       17.04      27  0.631111

In [67]:
df.nlargest(1, 'population')

             country_name  population  square   density
country_code
RUS                   Rus       143.5     171  0.839181

In [68]:
df.nlargest(2, 'square')

             country_name  population  square   density
country_code
RUS                   Rus      143.50     171  0.839181
KZ                    Kaz       17.04      27  0.631111

In [70]:
ml = pd.read_csv ('Documents/meteorite-landings.csv', sep = ',')
ml.tail()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.03700,17.01850,"(29.037000, 17.018500)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.78333,8.96667,"(13.783330, 8.966670)"
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.25000,17.66667,"(49.250000, 17.666670)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.78917,41.50460,"(49.789170, 41.504600)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,33.98333,-115.68333,"(33.983330, -115.683330)"

In [76]:
yaru = pd.read_html('https://mila-max.ru')

ValueError: No tables found

In [80]:
c_size = 10000
for ml_chunk in pd.read_csv ('Documents/meteorite-landings.csv', sep = ',', chunksize=c_size):
    print (ml_chunk.shape)

(10000, 10)
(10000, 10)
(10000, 10)
(10000, 10)
(5716, 10)

In [81]:
df = pd.read_csv ('Documents/meteorite-landings.csv', sep = ',')

In [82]:
df.to_csv ('Documents/meteorite-landings-output.csv', index = False)

In [83]:
df.head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.166670, -64.950000)"

In [84]:
df.tail()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,1990.0,29.03700,17.01850,"(29.037000, 17.018500)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,1999.0,13.78333,8.96667,"(13.783330, 8.966670)"
45713,Zlin,30410,Valid,H4,3.3,Found,1939.0,49.25000,17.66667,"(49.250000, 17.666670)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.78917,41.50460,"(49.789170, 41.504600)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,33.98333,-115.68333,"(33.983330, -115.683330)"

In [95]:
df.shape

(45716, 10)

In [97]:
df.index

RangeIndex(start=0, stop=45716, step=1)

In [98]:
df.describe()

                 id          mass          year        reclat       reclong
count  45716.000000  4.558500e+04  45428.000000  38401.000000  38401.000000
mean   26889.735104  1.327808e+04   1991.772189    -39.122580     61.074319
std    16860.683030  5.749889e+05     27.181247     46.378511     80.647298
min        1.000000  0.000000e+00    301.000000    -87.366670   -165.433330
25%    12688.750000  7.200000e+00   1987.000000    -76.714240      0.000000
50%    24261.500000  3.260000e+01   1998.000000    -71.500000     35.666670
75%    40656.750000  2.026000e+02   2003.000000      0.000000    157.166670
max    57458.000000  6.000000e+07   2501.000000     81.166670    354.473330

In [100]:
pd.set_option('display.precision', 3)

In [101]:
df.describe()

              id       mass       year     reclat    reclong
count  45716.000  4.558e+04  45428.000  38401.000  38401.000
mean   26889.735  1.328e+04   1991.772    -39.123     61.074
std    16860.683  5.750e+05     27.181     46.379     80.647
min        1.000  0.000e+00    301.000    -87.367   -165.433
25%    12688.750  7.200e+00   1987.000    -76.714      0.000
50%    24261.500  3.260e+01   1998.000    -71.500     35.667
75%    40656.750  2.026e+02   2003.000      0.000    157.167
max    57458.000  6.000e+07   2501.000     81.167    354.473

In [103]:
df.describe(include = [object])

          name nametype recclass   fall           GeoLocation
count    45716    45716    45716  45716                 38401
unique   45716        2      466      2                 17100
top     Aachen    Valid       L6  Found  (0.000000, 0.000000)
freq         1    45641     8285  44609                  6214

In [104]:
df.recclass.value_counts()[:5]

L6    8285
H5    7142
L5    4796
H6    4528
H4    4211
Name: recclass, dtype: int64

In [107]:
df.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass', 'fall', 'year', 'reclat',
       'reclong', 'GeoLocation'],
      dtype='object')

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB

In [116]:
df['mass'].nunique()

12576

In [119]:
from operator import itemgetter 

sorted(
       [(col, df[col].nunique()) for col in df.columns],
    key = itemgetter(1)
)

[('nametype', 2),
 ('fall', 2),
 ('year', 268),
 ('recclass', 466),
 ('mass', 12576),
 ('reclat', 12738),
 ('reclong', 14640),
 ('GeoLocation', 17100),
 ('name', 45716),
 ('id', 45716)]

In [120]:
df_with_cat = df.copy()
df_with_cat['recclass'] = df_with_cat['recclass'].astype('category')

In [121]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB

In [123]:
df_with_cat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  category
 4   mass         45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: category(1), float64(4), int64(1), object(4)
memory usage: 3.2+ MB

In [125]:
df.groupby('recclass')['mass'].mean().to_frame()

                           mass
recclass
Acapulcoite             490.424
Acapulcoite/Lodranite    31.793
Acapulcoite/lodranite    44.933
Achondrite-prim        1078.000
Achondrite-ung          895.846
...                         ...
Unknown                     NaN
Ureilite                490.015
Ureilite-an            1287.125
Ureilite-pmict          262.686
Winonaite              1129.013

[466 rows x 1 columns]

In [126]:
df_with_cat.groupby('recclass')['mass'].mean().to_frame()

                           mass
recclass
Acapulcoite             490.424
Acapulcoite/Lodranite    31.793
Acapulcoite/lodranite    44.933
Achondrite-prim        1078.000
Achondrite-ung          895.846
...                         ...
Unknown                     NaN
Ureilite                490.015
Ureilite-an            1287.125
Ureilite-pmict          262.686
Winonaite              1129.013

[466 rows x 1 columns]

In [129]:
df.sort_values(

    by = ['recclass', 'mass'],
    ascending =[True, False]

).head(2)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
27673,Northwest Africa 2656,32485,Valid,Acapulcoite,7500.0,Found,2003.0,NaN,NaN,NaN
30353,Northwest Africa 725,17807,Valid,Acapulcoite,3824.0,Found,NaN,30.6,-5.05,"(30.600000, -5.050000)"

In [130]:
df.sort_values(

    by = ['recclass', 'mass'],
    ascending =[True, True]

).head(2)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
37761,Superior Valley 014,34064,Valid,Acapulcoite,1.77,Found,2002.0,35.236,-117.042,"(35.236000, -117.042120)"
13939,Grove Mountains 021663,47835,Valid,Acapulcoite,2.19,Found,2003.0,-72.774,75.340,"(-72.773611, 75.339722)"

In [131]:
df.loc[0:5]

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.775,6.083,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.183,10.233,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.217,-113.000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.883,-99.900,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.167,-64.950,"(-33.166670, -64.950000)"
5,Adhi Kot,379,Valid,EH4,4239.0,Fell,1919.0,32.100,71.800,"(32.100000, 71.800000)"

In [132]:
df[df['name'] =='Abee']['mass'].mean()

107000.0

In [143]:
df[df['mass'] == 21.0][['name','mass']]

                               name  mass
0                            Aachen  21.0
2273              Allan Hills 88044  21.0
3978                   Asuka 880943  21.0
5083                    Bir Zar 006  21.0
5086                    Bir Zar 009  21.0
6259                Dar al Gani 495  21.0
6305                Dar al Gani 541  21.0
6442                Dar al Gani 679  21.0
6491                Dar al Gani 728  21.0
6608                Dar al Gani 845  21.0
8362           Dominion Range 03236  21.0
8433           Dominion Range 03306  21.0
8722           Dominion Range 08277  21.0
8774           Dominion Range 08331  21.0
8807           Dominion Range 08364  21.0
10230        Elephant Moraine 90223  21.0
10609        Elephant Moraine 90603  21.0
11120        Elephant Moraine 92121  21.0
12192       Frontier Mountain 90075  21.0
12973         Graves Nunataks 98170  21.0
16000         Hammadah al Hamra 030  21.0
16354                      Hatfield  21.0
17805         LaPaz Icefield 031103  21.0
18726          LaPaz Icefield 04600  21.0
18732          LaPaz Icefield 04606  21.0
18988          LaPaz Icefield 10064  21.0
20950             Lewis Cliff 88225  21.0
21731            Lucerne Valley 025  21.0
23043        Meteorite Hills 001089  21.0
23537         Meteorite Hills 00844  21.0
24605            Miller Range 07230  21.0
25353           Miller Range 090278  21.0
25373           Miller Range 090299  21.0
26650         Northwest Africa 1282  21.0
26830         Northwest Africa 1617  21.0
27966         Northwest Africa 3049  21.0
28218         Northwest Africa 3332  21.0
28486         Northwest Africa 4245  21.0
28573         Northwest Africa 4331  21.0
29027         Northwest Africa 4892  21.0
29164         Northwest Africa 5107  21.0
29175         Northwest Africa 5118  21.0
29423         Northwest Africa 5567  21.0
31739       Pecora Escarpment 91259  21.0
32487   Queen Alexandra Range 93243  21.0
32674   Queen Alexandra Range 93431  21.0
33669  Queen Alexandra Range 971006  21.0
34522   Queen Alexandra Range 97913  21.0
34552   Queen Alexandra Range 97943  21.0
38170      United Arab Emirates 012  21.0

In [144]:
df.fall.value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

In [147]:
df[['mass','year']].apply (np.max)

mass    6.000e+07
year    2.501e+03
dtype: float64

In [154]:
d ={ 'Found': 1, 'Fell':0}
df['status']=df['fall'].map(d) 
df.tail(2)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,status
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,2003.0,49.789,41.505,"(49.789170, 41.504600)",1
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,1976.0,33.983,-115.683,"(33.983330, -115.683330)",1

In [156]:
df.groupby(by = 'fall')['mass'].max()

fall
Fell     2.300e+07
Found    6.000e+07
Name: mass, dtype: float64

In [3]:
import pandas as pd

In [4]:

left = pd.DataFrame (
    {
        "A": ["A0", "A1", "A2"],
        "B": ["B0", "B1", "B2"]
    }, 
    index = ["K0", "K1", "K2"]
  
)
right = pd.DataFrame (
    {
        "C": ["C0", "C1", "C2"],
        "D": ["D0", "D1", "D2"]
    }, 
    index = ["K0", "K2", "K3"]
  
)
result = left.join(right)

In [7]:
result

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [8]:
result = left.join(right, how = 'outer')

In [9]:
result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

In [11]:
result = pd.merge(
left, right,
    left_index=True, right_index=True,
    how= 'outer'
)

In [12]:
result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

In [15]:

left = pd.DataFrame (
    {
        "A": ["A0", "A1", "A2","A3"],
        "B": ["B0", "B1", "B2","B3"],
        "key": ["K0", "K1", "K1", "K1"]
    }, 
  
  
)
right = pd.DataFrame (
    {
        "C": ["C0", "C1"],
        "D": ["D0", "D1"]
    }, 
    index = ["K0", "K1"]
  
)
result = left.join(right, on="key")

In [16]:
result

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K1  C1  D1
3  A3  B3  K1  C1  D1

In [26]:

df1 = pd.DataFrame (
    {
        "A": ["A0", "A1", "A2"],
        "B": ["B0", "B1", "B2"]
    }, 
    index = [1, 2, 3]
  
)
df2 = pd.DataFrame (
    {
        "A": ["A3", "A4", "A5"],
        "B": ["B3", "B4", "B5"]
    }, 
    index = [4, 5, 6]
  
)
df3 = pd.DataFrame (
    {
        "A": ["A6", "A7", "A8"],
        "B": ["B3", "B4", "B5"]
    }, 
    index = [7, 8, 9]
  
)
result = pd.concat([df1, df2, df3 ])

In [18]:
result

    A   B
1  A0  B0
2  A1  B1
3  A2  B2
4  A3  B3
5  A4  B4
6  A5  B5
7  A6  B3
8  A7  B4
9  A8  B5

In [25]:
df4 = pd.DataFrame (
    {
        "A": ["A6", "A7", "A8"],
        "F": ["F3", "F4", "F5"],
    }, 
    index = [2, 3, 6],
   
 )

In [27]:
a = pd.concat([df1, df4], axis = 1)

In [29]:
df1, df4, a

(    A   B
 1  A0  B0
 2  A1  B1
 3  A2  B2,
     A   F
 2  A6  F3
 3  A7  F4
 6  A8  F5,
      A    B    A    F
 1   A0   B0  NaN  NaN
 2   A1   B1   A6   F3
 3   A2   B2   A7   F4
 6  NaN  NaN   A8   F5)

In [30]:
result = df1.append(df2)

In [31]:
result

    A   B
1  A0  B0
2  A1  B1
3  A2  B2
4  A3  B3
5  A4  B4
6  A5  B5